# FailureMessageKey Class

---
A unique key assigned to each posted failure message
SystemObject Autodesk.Revit.DBFailureMessageKey
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FailureMessageKey : IDisposable

    Public Class FailureMessageKey
    	Implements IDisposable

    public ref class FailureMessageKey : IDisposable

    type FailureMessageKey =
        class
            interface IDisposable
        end
The FailureMessageKey type exposes the following members.
| Name| Description
---|---|---
| FailureMessageKey|  Constructs a new FailureMessageKey with default settings.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the FailureMessageKey
| Equals|  Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object))
| GetHashCode|  Gets the integer value of the id as hash code (Overrides ObjectGetHashCode)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| IsEqual|  Checks it this key is equal to the other.
| IsValid|  Checks if the failure message key is valid
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
| Name| Description
---|---|---
| Equality(FailureMessageKey, FailureMessageKey)| Determines whether two FailureMessageKeys are the same.
| Inequality(FailureMessageKey, FailureMessageKey)| Determines whether two FailureMessageKeys are different.
Top
When a failure message is posted, it gets a unique key assigned and returned to the caller. The key is guaranteed to be unique in the Revit session. The key can be used to unpost (delete) previously posted failure message if it is no longer valid.
#### Reference
Autodesk.Revit.DB Namespace